cavidade/icoFoam/Re-4030/m02/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L 0.1;   // comprimento em x
D 0.1;   //comprimento em y
S 0.01;  //comprimento em z

vertices
(
    (0  0  0)		//vertice 0
    ($L 0  0)		//vertice 1
    ($L $D 0)		//vertice 2
    (0  $D 0)		//vertice 3
    (0  0  $S)		//vertice 4
    ($L 0  $S)		//vertice 5
    ($L $D $S)		//vertice 6
    (0  $D $S)		//vertice 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
            (0 4 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
);

// ************************************************************************* //
